//Завдання 1: Визначення дня тижня Напиши програму, яка запитує у користувача номер дня тижня (від 1 до 7)
//і виводить назву відповідного дня (1 — понеділок, 2 — вівторок і т.д.). Використай switch case.

let weekday = parseInt(promt("Enter a number 1-7 to pick a day fo the week: ")); 

switch (weekday) {
  case 1:
    alert("понеділок");
    break;

  case 2:
    alert("вівторок");
    break;

  case 3:
    alert("середа");
    break;

  case 4:
    alert("четверг");
    break;

  case 5:
    alert("п ятниця");
    break;

  case 6:
    alert("субота");
    break;

  case 7:
    alert("неділя");
    break;
  
  default:
    alert("Unknown");
    break;
}

//Завдання 2: Визначення пори року Напиши програму, яка запитує у користувача номер місяця(від 1 до 12)
//і виводить пору року(1 - 3 — зима, 4 - 6 — весна, 7 - 9 — літо, 10 - 12 — осінь).Використай switch case.

let season = parseInt(prompt("Enter a number 1-12:"));


//Завдання 3: Визначення категорії віку Напиши програму, яка запитує у користувача вік і визначає категорію: дитина(0 - 12),
//підліток(13 - 17), дорослий(18 - 64), пенсіонер(65 і більше).Використай switch case.



//Завдання 4: Вибір математичної операції Напиши програму, яка запитує у користувача операцію(+, -, *, /) і два числа.
//Використай switch case для виконання обраної операції та виводу результату.


//Завдання 5: Визначення місяця за назвою Напиши програму, яка запитує у користувача назву місяця(наприклад, "Січень")
//і виводить його порядковий номер(1 для Січня, 2 для Лютого і т.д.).Використай switch case.


//Завдання 6: Калькулятор чайових Напиши програму, яка запитує у користувача рейтинг обслуговування("відмінно", "добре", "задовільно")
//і нараховує відсоток чайових: 20 % для "відмінно", 15 % для "добре", 10 % для "задовільно".Використай switch case.

